VOLTAGE_VALUE_MAPPING = {
    'מתח נמוך':1,
    'מתח גבוה':2
}

IEC_REPLY_VALUE_MAPPING = {
    'חיובית':1,
    'חיובית חלקית':5,
    'חיובית מוגבלת':4,
    'שלילית':3
}

#Old Mapping
# IEC_REPLY_VALUE_MAPPING = {
#     'חיובית':1,
#     'חיובית חלקית':2,
#     'חיובית מוגבלת':3,
#     'שלילית':4
# }

VOLTAGE_CODE_MAPPING = {
    1:'מתח נמוך',
    2:'מתח גבוה'
}

IEC_REPLY_CODE_MAPPING = {
    1:'חיובית',
    5:'חיובית חלקית',
    4:'חיובית מוגבלת',
    3:'שלילית'
}

AGAF_CODE_MAPPING = {
    7:'חיפה והצפון',
    8:'דן והחוף',
    9:'ירושלים ונגב'
}

NAPA_CODE_MAPPING = {
    701:'חיפה',
    702:'עמקים',
    703:'גליל וגולן',
    801:'דן',
    802:'שרון',
    803:'שפלה',
    901:'ירושלים',
    902:'נגב',
    903:'איילון'
}